Revit 2027 API
ModelPathUtils Class
 Utility functions using ModelPaths
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ModelPathUtils
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class ModelPathUtils
Public NotInheritable Class ModelPathUtils
public ref class ModelPathUtils abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type ModelPathUtils = class end
The ModelPathUtils type exposes the following members.
Properties
Name | Description
CloudRegionEMEA | Obsolete.
 The name of cloud region EMEA. This method is deprecated in Revit 2026.3 and may be removed in a later version of Revit. See GetAllCloudRegions to get the list of all available regions.
CloudRegionUS | Obsolete.
 The name of cloud region US. This method is deprecated in Revit 2026.3 and may be removed in a later version of Revit. See GetAllCloudRegions to get the list of all available regions.
Top
Methods
Name | Description
ConvertCloudGUIDsToCloudPath |  Converts a pair of cloud project and model GUIDs to a valid cloud path.
ConvertModelPathToUserVisiblePath |  Gets a string version of the path of a given ModelPath.
ConvertUserVisiblePathToModelPath |  Converts a user-visible path (string) to a ModelPath.
GetAllCloudRegions |  Gets all available regions that are supported by the cloud service. It returns an empty list when something gets wrong. Check the journal to see the error message for further information.
IsValidUserVisibleFullServerPath |  Determines whether the given string represents a valid server path.
Top
See Also
Reference
Autodesk.Revit.DB Namespace